dot_emacs.d/configuration.org
#+TITLE: Emacs Configuration
#+AUTHOR: Zach
#+EMAIL:
#+OPTIONS: toc:nil num:nil
This is a test org config file that's a frankenstein from
 https://github.com/hrs/dotfiles/blob/main/emacs/dot-emacs.d/configuration.org
which is much more organized and thought.

* Configure =use-package=

I use =use-package= to install and configure my packages. My =init.el= includes
the initial setup for =package.el= and ensures that =use-package= is installed,
since I wanna do that right away.

This makes sure that =use-package= will install the package if it's not already
available. It also means that I should be able to open Emacs for the first time
on a fresh Debian box and have my whole environment automatically installed. I'm
not /totally/ sure about that, but we're gettin' close.

#+begin_src emacs-lisp
  (require 'use-package-ensure)
  (setq use-package-always-ensure t)
#+end_src

Always compile packages, and use the newest version available.

#+begin_src emacs-lisp
  (use-package auto-compile
    :config (auto-compile-on-load-mode))
  (setq load-prefer-newer t)
#+end_src

* Set personal information

** Who am I? Where am I?

# #+begin_src emacs-lisp
#   (setq user-full-name ""
#         user-mail-address ""
#         calendar-latitude 0.0
#         calendar-longitude 0.0
#         calendar-location-name "")
# #+end_src

# * Add =resources= to =load-path=

# #+begin_src emacs-lisp
#   (add-to-list 'load-path "~/.emacs.d/resources/")
# #+end_src

* Utility functions

Define a big ol' bunch of handy utility functions.

#+begin_src emacs-lisp
  (defun zb/rename-file (new-name)
    (interactive "FNew name: ")
    (let ((filename (buffer-file-name)))
      (if filename
	  (progn
	    (when (buffer-modified-p)
	      (save-buffer))
	    (rename-file filename new-name t)
	    (kill-buffer (current-buffer))
	    (find-file new-name)
	    (message "Renamed '%s' -> '%s'" filename new-name))
	(message "Buffer '%s' isn't backed by a file!" (buffer-name)))))

  (defun zb/generate-scratch-buffer ()
    "Create and switch to a temporary scratch buffer with a random
	 name."
    (interactive)
    (switch-to-buffer (make-temp-name "scratch-")))

  (defun zb/find-file-as-sudo ()
    (interactive)
    (let ((file-name (buffer-file-name)))
      (when file-name
	(find-alternate-file (concat "/sudo::" file-name)))))

  (defun zb/region-or-word ()
    (if mark-active
	(buffer-substring-no-properties (region-beginning)
					(region-end))
      (thing-at-point 'word)))

  (defun zb/append-to-path (path)
    "Add a path both to the $PATH variable and to Emacs' exec-path."
    (setenv "PATH" (concat (getenv "PATH") ":" path))
    (add-to-list 'exec-path path))

  (defun zb/insert-password ()
    (interactive)
    (shell-command "pwgen 30 -1" t))

  (defun zb/notify-send (title message)
    "Display a desktop notification by shelling out to `notify-send'."
    (call-process-shell-command
     (format "notify-send -t 2000 \"%s\" \"%s\"" title message)))
#+end_src

* UI preferences

** UTF-8 complience

#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8)
#+end_src

** =treemacs=

# #+begin_src emacs-lisp
#   (use-package treemacs)
# ;;  (treemacs-enable)
# #+end_src

** Tweak window chrome

I don't usually use the menu or scroll bar, and they take up useful space.

#+begin_src emacs-lisp
  (tool-bar-mode 0)
  (menu-bar-mode 0)
  (scroll-bar-mode -1)
  (global-linum-mode t)
  (column-number-mode t)
;;  (setq inhibit-startup-message t)
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

** Ido mode

#+begin_src emacs-lisp
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)
#+end_src

** Visual Line Mode

#+begin_src emacs-lisp
  (global-visual-line-mode)
#+end_src

The default frame title isn't useful. This binds it to the name of the current
project:

#+begin_src emacs-lisp
  (setq frame-title-format "%b")
  ;; (setq frame-title-format '((:eval (projectile-project-name))))
#+end_src

** Use fancy lambdas

Why not?

#+begin_src emacs-lisp
  (global-prettify-symbols-mode t)
#+end_src

** Load up a theme
#+begin_src emacs-lisp
  (use-package abyss-theme)
  (load-theme 'abyss t)
#+end_src

    # abyss-theme
    # underwater-theme
    # challenger-deep-theme
    # cyberpunk-theme
    # dakrone-theme
    # dracula-theme
    # espresso-theme
    # exotica-theme

** Use =moody= for a beautiful modeline

This gives me a truly lovely ribbon-based modeline.

#+begin_src emacs-lisp
    (use-package moody
      :config
      (setq x-underline-at-descent-line t
	    moody-mode-line-height 30)
    (moody-replace-mode-line-buffer-identification))
;;    (moody-replace-vc-mode))
#+end_src


** Use =minions= to hide all minor modes

I never want to see a minor mode, and manually adding =:diminish= to every
use-package declaration is a hassle. This uses =minions= to hide all the minor
modes in the modeline. Nice!

By default there's a =;-)= after the major mode; that's an adorable default, but
I'd rather skip it.

#+begin_src emacs-lisp
   (use-package minions
     :config
     (setq minions-mode-line-lighter ""
           minions-mode-line-delimiters '("" . ""))
     (minions-mode 1))
#+end_src

** Set default font and configure font resizing

I'm partial to Source Code Pro.

The standard =text-scale-= functions just resize the text in the current buffer;
I'd generally like to resize the text in /every/ buffer, and I usually want to
change the size of the modeline, too (this is especially helpful when
presenting). These functions and bindings let me resize everything all together!

Note that this overrides the default font-related keybindings from
=sensible-defaults=.

#+begin_src emacs-lisp
  (setq zb/default-font "Source Code Pro")
  (setq zb/default-font-size 12)
  (setq zb/current-font-size zb/default-font-size)

  (setq zb/font-change-increment 1.1)

  (defun zb/font-code ()
    "Return a string representing the current font (like \"Source Code Pro-14\")."
    (concat zb/default-font "-" (number-to-string zb/current-font-size)))

  (defun zb/set-font-size ()
    "Set the font to `zb/default-font' at `zb/current-font-size'.
  Set that for the current frame, and also make it the default for
  other, future frames."
    (let ((font-code (zb/font-code)))
      (if (assoc 'font default-frame-alist)
	  (setcdr (assoc 'font default-frame-alist) font-code)
	(add-to-list 'default-frame-alist (cons 'font font-code)))
      (set-frame-font font-code)))

  (defun zb/reset-font-size ()
    "Change font size back to `zb/default-font-size'."
    (interactive)
    (setq zb/current-font-size zb/default-font-size)
    (zb/set-font-size))

  (defun zb/increase-font-size ()
    "Increase current font size by a factor of `zb/font-change-increment'."
    (interactive)
    (setq zb/current-font-size
	  (ceiling (* zb/current-font-size zb/font-change-increment)))
    (zb/set-font-size))

  (defun zb/decrease-font-size ()
    "Decrease current font size by a factor of `zb/font-change-increment', down to a minimum size of 1."
    (interactive)
    (setq zb/current-font-size
	  (max 1
	  (floor (/ zb/current-font-size zb/font-change-increment))))
    (zb/set-font-size))

  (define-key global-map (kbd "C-)") 'zb/reset-font-size)
  (define-key global-map (kbd "C-+") 'zb/increase-font-size)
  (define-key global-map (kbd "C--") 'zb/decrease-font-size)
  (zb/reset-font-size)
#+end_src

** Highlight the current line

=global-hl-line-mode= softly highlights the background color of the line
containing point. It makes it a bit easier to find point, and it's useful when
pairing or presenting code.

#+begin_src emacs-lisp
  (global-hl-line-mode)
#+end_src

** Highlight uncommitted changes

Use the =diff-hl= package to highlight changed-and-uncommitted lines when
programming.

#+begin_src emacs-lisp
  (use-package diff-hl
    :config
    (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
    (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode))
#+end_src

* Project management

I use a few packages in virtually every programming or writing environment to
manage the project, handle auto-completion, search for terms, and deal with
version control. That's all in here.

# ** =ag=

# Install =ag= to provide search within projects (usually through
# =projectile-ag=).

# #+begin_src emacs-lisp
#   (use-package ag)
# #+end_src

** =company=

Use =company-mode= everywhere.

#+begin_src emacs-lisp
  (use-package company)
  (add-hook 'after-init-hook 'global-company-mode)
#+end_src

Use =M-/= for completion.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-/") 'company-complete-common)
#+end_src

# ** =dumb-jump=

# The =dumb-jump= package works well enough in a [[https://github.com/jacktasia/dumb-jump#supported-languages][ton of environments]], and it
# doesn't require any additional setup. I've bound its most useful command to
# =M-.=.

# #+begin_src emacs-lisp
#   (use-package dumb-jump
#     :config
#     (define-key evil-normal-state-map (kbd "M-.") 'dumb-jump-go)
#     (setq dumb-jump-selector 'ivy))
# #+end_src

** =flycheck=

I'd like to enable flycheck all kinds of places.

#+begin_src emacs-lisp
  (use-package let-alist)
  (use-package flycheck
    :hook ruby-mode)
#+end_src

** =magit=

I use =magit= to handle version control. It's lovely, but I tweak a few things:

- I bring up the status menu with =C-x g=.
- Use =evil= keybindings with =magit=.
- The default behavior of =magit= is to ask before pushing. I haven't had any
  problems with accidentally pushing, so I'd rather not confirm that every time.
- Per [[http://tbaggery.com/2008/04/19/a-note-about-git-commit-messages.html][tpope's suggestions]], highlight commit text in the summary line that goes
  beyond 50 characters.
- I'd like to start in the insert state when writing a commit message.

#+begin_src emacs-lisp
  (use-package magit
    :bind
    ("C-x g" . magit-status)

    :config
    (use-package with-editor)

    (setq magit-push-always-verify nil
	  git-commit-summary-max-length 50))
#+end_src

# I've been playing around with the newly-released =forge= for managing GitHub PRs
# and issues. Seems slick so far.

# #+begin_src emacs-lisp
#   (use-package ghub)
#   (use-package forge)
# #+end_src

I'm also partial to =git-timemachine=, which lets you quickly page through the
history of a file.

#+begin_src emacs-lisp
  (use-package git-timemachine)
#+end_src

