dot_emacs.d/configuration.el
(require 'use-package-ensure)
(setq use-package-always-ensure t)

(use-package auto-compile
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)

(setq user-full-name "Zachary Bombay"
      user-mail-address "zacharybombay@gmail.com"
      calendar-latitude 39.034655
      calendar-longitude -77.380606
      calendar-location-name "Sterling, VA")

(defun zb/rename-file (new-name)
  (interactive "FNew name: ")
  (let ((filename (buffer-file-name)))
    (if filename
	(progn
	  (when (buffer-modified-p)
	    (save-buffer))
	  (rename-file filename new-name t)
	  (kill-buffer (current-buffer))
	  (find-file new-name)
	  (message "Renamed '%s' -> '%s'" filename new-name))
(message "Buffer '%s' isn't backed by a file!" (buffer-name)))))

(defun zb/generate-scratch-buffer ()
  "Create and switch to a temporary scratch buffer with a random
 name."
  (interactive)
  (switch-to-buffer (make-temp-name "scratch-")))

(defun zb/find-file-as-sudo ()
  (interactive)
  (let ((file-name (buffer-file-name)))
    (when file-name
(find-alternate-file (concat "/sudo::" file-name)))))

(defun zb/region-or-word ()
  (if mark-active
(buffer-substring-no-properties (region-beginning)
				(region-end))
    (thing-at-point 'word)))

(defun zb/append-to-path (path)
  "Add a path both to the $PATH variable and to Emacs' exec-path."
  (setenv "PATH" (concat (getenv "PATH") ":" path))
  (add-to-list 'exec-path path))

(defun zb/insert-password ()
  (interactive)
  (shell-command "pwgen 30 -1" t))

(defun zb/notify-send (title message)
  "Display a desktop notification by shelling out to `notify-send'."
  (call-process-shell-command
   (format "notify-send -t 2000 \"%s\" \"%s\"" title message)))

(use-package treemacs)
;;  (treemacs-enable)

(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode -1)
(global-linum-mode t)
(column-number-mode t)
(add-hook 'before-save-hook 'delete-trailing-whitespace)

(setq frame-title-format "%b")
;; (setq frame-title-format '((:eval (projectile-project-name))))

(global-prettify-symbols-mode t)

(use-package abyss-theme)
;; (load-theme 'abyss t)

(use-package moody
  :config
  (setq x-underline-at-descent-line t
	moody-mode-line-height 30))

(setq zb/default-font "Source Code Pro")
(setq zb/default-font-size 12)
(setq zb/current-font-size zb/default-font-size)

(setq zb/font-change-increment 1.1)

(defun zb/font-code ()
  "Return a string representing the current font (like \"Source Code Pro-14\")."
  (concat zb/default-font "-" (number-to-string zb/current-font-size)))

(defun zb/set-font-size ()
  "Set the font to `zb/default-font' at `zb/current-font-size'.
Set that for the current frame, and also make it the default for
other, future frames."
  (let ((font-code (zb/font-code)))
    (if (assoc 'font default-frame-alist)
	(setcdr (assoc 'font default-frame-alist) font-code)
(add-to-list 'default-frame-alist (cons 'font font-code)))
    (set-frame-font font-code)))

(defun zb/reset-font-size ()
  "Change font size back to `zb/default-font-size'."
  (interactive)
  (setq zb/current-font-size zb/default-font-size)
  (zb/set-font-size))

(defun zb/increase-font-size ()
  "Increase current font size by a factor of `zb/font-change-increment'."
  (interactive)
  (setq zb/current-font-size
	(ceiling (* zb/current-font-size zb/font-change-increment)))
  (zb/set-font-size))

(defun zb/decrease-font-size ()
  "Decrease current font size by a factor of `zb/font-change-increment', down to a minimum size of 1."
  (interactive)
  (setq zb/current-font-size
	(max 1
	(floor (/ zb/current-font-size zb/font-change-increment))))
  (zb/set-font-size))

(define-key global-map (kbd "C-)") 'zb/reset-font-size)
(define-key global-map (kbd "C-+") 'zb/increase-font-size)
(define-key global-map (kbd "C--") 'zb/decrease-font-size)
(zb/reset-font-size)

(global-hl-line-mode)

(use-package diff-hl
  :config
  (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
  (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode))

(use-package company)
(add-hook 'after-init-hook 'global-company-mode)

(global-set-key (kbd "M-/") 'company-complete-common)

(use-package let-alist)
(use-package flycheck
  :hook ruby-mode)

(use-package magit
  :bind
  ("C-x g" . magit-status)

  :config
  (use-package with-editor)

  (setq magit-push-always-verify nil
	git-commit-summary-max-length 50))

(use-package git-timemachine)
