dot_emacs.d/configuration.org
** =projectile=

Projectile's default binding of =projectile-ag= to =C-c p s s= is clunky enough
that I rarely use it (and forget it when I need it). This binds it to the
easier-to-type =C-c v= to useful searches.

Bind =C-p= to fuzzy-finding files in the current project. We also need to
explicitly set that in a few other modes.

I use =ivy= as my completion system.

When I visit a project with =projectile-switch-project=, the default action is
to search for a file in that project. I'd rather just open up the top-level
directory of the project in =dired= and find (or create) new files from there.

I'd like to /always/ be able to recursively fuzzy-search for files, not just
when I'm in a Projectile-defined project. I use the current directory as a
project root (if I'm not in a "real" project).

#+begin_src emacs-lisp
  (use-package projectile
    :bind
    ("C-c v" . projectile-ag)

    :config
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

    (setq projectile-completion-system 'ivy
	  projectile-switch-project-action 'projectile-dired
	  projectile-require-project-root nil))
#+end_src

** =restclient=

# #+begin_src emacs-lisp
#   (use-package restclient)
#   (use-package company-restclient
#     :config
#     (add-to-list 'company-backends 'company-restclient))
# #+end_src

** =undo-tree=

# I like tree-based undo management. I only rarely need it, but when I do, oh boy.

# #+begin_src emacs-lisp
#   (use-package undo-tree)
# #+end_src

* Programming environments

I like shallow indentation, but tabs are displayed as 8 characters by default.
This reduces that.

#+begin_src emacs-lisp
  (setq-default tab-width 2)
#+end_src

Treating terms in CamelCase symbols as separate words makes editing a little
easier for me, so I like to use =subword-mode= everywhere.

#+begin_src emacs-lisp
  (use-package subword
    :config (global-subword-mode 1))
#+end_src

Compilation output goes to the =*compilation*= buffer. I rarely have that window
selected, so the compilation output disappears past the bottom of the window.
This automatically scrolls the compilation window so I can always see the
output.

#+begin_src emacs-lisp
  (setq compilation-scroll-output t)
#+end_src

I use =eglot= as my LSP client.

#+begin_src emacs-lisp
  (use-package eglot)
#+end_src

** Coq

# I use =company-coq-mode=, which really helps make Proof General a more useful IDE.

# #+begin_src emacs-lisp
#   (use-package company-coq)
# #+end_src

# I bind the right and left arrow keys to evaluating and retracting the next and
# previous statements. This is more convenient than the default bindings of =C-c
# C-n= and =C-c C-u=.

# I also like to disable =abbrev-mode=; it has a ton of abbreviations for Coq, but
# they've always been unpleasant surprises for me.

# #+begin_src emacs-lisp
#   (add-hook 'coq-mode-hook
#             (lambda ()
#               (company-coq-mode)
#               (evil-define-key 'normal coq-mode-map (kbd "<down>") 'proof-assert-next-command-interactive)
#               (evil-define-key 'normal coq-mode-map (kbd "<up>") 'proof-undo-last-successful-command)
#               (evil-define-key 'normal coq-mode-map (kbd "<return>") 'company-coq-proof-goto-point)
#               (abbrev-mode 0)))
# #+end_src

# The default Proof General layout stacks the code, goal, and response buffers on
# top of each other. I like to keep my code on one side and my goal and response
# buffers on the other.

# #+begin_src emacs-lisp
#   (setq proof-three-window-mode-policy 'hybrid)
# #+end_src

# Don't move point when asserting and undoing proof commands.

# #+begin_src emacs-lisp
#   (setq proof-follow-mode 'ignore)
# #+end_src

# The Proof General splash screen's pretty cute, but I don't need to see it every
# time.

# #+begin_src emacs-lisp
#   (setq proof-splash-enable nil)
# #+end_src

# Proof General usually evaluates each comment individually. In literate programs,
# this can result in evaluating a /ton/ of comments. This evaluates a series of
# consecutive comments as a single comment.

# #+begin_src emacs-lisp
#   (setq proof-script-fly-past-comments t)
# #+end_src

** CSS, Sass, and Less

Indent by 2 spaces.

#+begin_src emacs-lisp
  (use-package css-mode
    :config
    (setq css-indent-offset 2))
#+end_src

Don't compile the current SCSS file every time I save.

#+begin_src emacs-lisp
  (use-package scss-mode
    :config
    (setq scss-compile-at-save nil))
#+end_src

Install Less.

#+begin_src emacs-lisp
  (use-package less-css-mode)
#+end_src

** Golang

Install =go-mode= and related packages:

#+begin_src emacs-lisp
  (use-package go-mode)
  (use-package go-errcheck)
  (use-package company-go)
#+end_src

Define my =$GOPATH= and tell Emacs where to find the Go binaries.

#+begin_src emacs-lisp
  (setenv "GOPATH" "/home/zach/code/go")
  (zb/append-to-path (concat (getenv "GOPATH") "/bin"))
#+end_src

Run =goimports= on every file when saving, which formats the file and
automatically updates the list of imports. This requires that the =goimports=
binary be installed.

#+begin_src emacs-lisp
  (setq gofmt-command "goimports")
  (add-hook 'before-save-hook 'gofmt-before-save)
#+end_src

When I open a Go file,

- Start up =company-mode= with the Go backend. This requires that the =gocode=
  binary is installed,
- Redefine the default =compile= command to something Go-specific, and
- Enable =flycheck=.

#+begin_src emacs-lisp
  (add-hook 'go-mode-hook
            (lambda ()
              (set (make-local-variable 'company-backends)
                   '(company-go))
              (company-mode)
              (if (not (string-match "go" compile-command))
                  (set (make-local-variable 'compile-command)
                       "go build -v && go test -v && go vet"))
              (flycheck-mode)))
#+end_src

# ** Haml and Slim

# Install the Haml and Slim packages.

# #+begin_src emacs-lisp
#   (use-package haml-mode)
#   (use-package slim-mode)
# #+end_src

** Haskell

#+begin_src emacs-lisp
  (use-package haskell-mode)
#+end_src

Enable =haskell-doc-mode=, which displays the type signature of a function, and
use smart indentation.

#+begin_src emacs-lisp
  (add-hook 'haskell-mode-hook
            (lambda ()
              (haskell-doc-mode)
              (turn-on-haskell-indent)))
#+end_src

#+begin_src emacs-lisp
  (zb/append-to-path "~/.cabal/bin")
#+end_src

** JavaScript and CoffeeScript

Install =coffee-mode= from editing CoffeeScript code.

#+begin_src emacs-lisp
  (use-package coffee-mode)
#+end_src

Indent everything by 2 spaces.

#+begin_src emacs-lisp
  (setq js-indent-level 2)

  (add-hook 'coffee-mode-hook
            (lambda ()
              (yas-minor-mode 1)
              (setq coffee-tab-width 2)))
#+end_src

** Lisps

*** Racket

# #+begin_src emacs-lisp
#   (use-package racket-mode)
# #+end_src

# [[https://docs.racket-lang.org/pollen/][Pollen]] uses a lozenge ◊ to mark preprocessor commands (like defining and
# dereferencing variables). That's awkward to type, so this lets me hit =M-^= to
# insert one.

# #+begin_src emacs-lisp
#   (defun zb/insert-lozenge ()
#     (interactive)
#     (insert "◊"))

#   (define-key racket-mode-map (kbd "M-^") 'zb/insert-lozenge)
# #+end_src

*** All Lisps

I like to use =paredit= in Lisp modes to balance parentheses (and more!).

#+begin_src emacs-lisp
  (use-package paredit)
#+end_src

=rainbow-delimiters= is convenient for coloring matching parentheses.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters)
#+end_src

All the lisps have some shared features, so we want to do the same things for
all of them. That includes using =paredit=, =rainbow-delimiters=, and
highlighting the whole expression when point is on a parenthesis.

#+begin_src emacs-lisp
  (setq lispy-mode-hooks
        '(clojure-mode-hook
          emacs-lisp-mode-hook
          lisp-mode-hook
          scheme-mode-hook))

  (dolist (hook lispy-mode-hooks)
    (add-hook hook (lambda ()
                     (setq show-paren-style 'expression)
                     (paredit-mode)
                     (rainbow-delimiters-mode))))
#+end_src

If I'm writing in Emacs lisp I'd like to use =eldoc-mode= to display
documentation.

#+begin_src emacs-lisp
  (use-package eldoc
    :config
    (add-hook 'emacs-lisp-mode-hook 'eldoc-mode))
#+end_src

I also like using =flycheck-package= to ensure that my Elisp packages are
correctly formatted.

#+begin_src emacs-lisp
  (use-package flycheck-package)

  (eval-after-load 'flycheck
    '(flycheck-package-setup))
#+end_src

# ** OCaml

# Use =tuareg-mode= for editing OCaml.

# #+begin_src emacs-lisp
#   (use-package tuareg
#     :config
#     (electric-indent-mode 0))
# #+end_src

# Configure Merlin. This also requires installing the Merlin package through OPAM
# with =opam install merlin=.

# #+begin_src emacs-lisp
#   (use-package merlin
#     :config
#     (add-hook 'tuareg-mode-hook 'merlin-mode t)

#     (with-eval-after-load 'company
#       (add-to-list 'company-backends 'merlin-company-backend))
#     (add-hook 'merlin-mode-hook 'company-mode))
# #+end_src

** Python

Use python-mode package and set python executable path depending on OS.
#+begin_src emacs-lisp
  (use-package python-mode)
  (cond
    ((string-equal system-type "windows-nt")
      (progn
        (zb/append-to-path "C:\\Python38\\Scripts")))
    ((string-equal system-type "gnu/linux")
      (progn
        (zb/append-to-path "~/.local/bin"))))
#+end_src

Enable =elpy=. This provides automatic indentation, auto-completion, syntax
checking, etc.

#+begin_src emacs-lisp
  (use-package elpy)
  (elpy-enable)
  (setq python-shell-interpreter "python"
        python-shell-interpreter-args "-i")
#+end_src

Use =flycheck= for syntax checking:

#+begin_src emacs-lisp
  (add-hook 'elpy-mode-hook 'flycheck-mode)
#+end_src

# Use =blacken= to quickly format other people's Python scripts into something
# that resembles PEP8 standards (I'm looking at you, Bill)

# #+begin_src emacs-lisp
#   (use-package blacken)
#   (blacken-enable)
# #+end_src


Format code according to PEP8 on save:

# #+begin_src emacs-lisp
#   (use-package py-autopep8)
#   (require 'py-autopep8)
#   (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
# #+end_src

Configure Jedi along with the associated =company= mode:

#+begin_src emacs-lisp
  (use-package company-jedi)
  (add-to-list 'company-backends 'company-jedi)

  (add-hook 'python-mode-hook 'jedi:setup)
  (setq jedi:complete-on-dot t)
#+end_src

** Rust

Use =rust-mode= to edit Rust code.

Run =rustfmt= automatically when saving a file.

#+begin_src emacs-lisp
  (use-package rust-mode
    :config
    (zb/append-to-path "~/.cargo/bin")
    (setq rust-format-on-save t))
#+end_src

** =sh=

Indent with 2 spaces.

#+begin_src emacs-lisp
  (add-hook 'sh-mode-hook
            (lambda ()
              (setq sh-basic-offset 2
                    sh-indentation 2)))
#+end_src

** Scala

# Ensure that =scala-mode= and =sbt-mode= are installed.

# #+begin_src emacs-lisp
#   (use-package scala-mode
#     :interpreter
#     ("scala" . scala-mode))
#   (use-package sbt-mode)
# #+end_src

# Don't show the startup message with launching ENSIME:

# #+begin_src emacs-lisp
#   (setq ensime-startup-notification nil)
# #+end_src

# Bind a few keys to common operations:

# #+begin_src emacs-lisp
#   (evil-define-key 'normal ensime-mode-map (kbd "C-t") 'ensime-type-at-point)
#   (evil-define-key 'normal ensime-mode-map (kbd "M-.") 'ensime-edit-definition)
# #+end_src

** Terraform

# Install =terraform-mode=.

# #+begin_src emacs-lisp
#   (use-package terraform-mode)
#   (use-package company-terraform)
# #+end_src

# ** =web-mode=

# #+begin_src emacs-lisp
#   (use-package web-mode
#     :config
#     (setq web-mode-markup-indent-offset 2
#           web-mode-css-indent-offset 2
#           web-mode-code-indent-offset 2
#           web-mode-indent-style 2))
# #+end_src

# I'd like to see colors with =rainbow-mode=, so we'll need to install that, too:

# #+begin_src emacs-lisp
#   (use-package rainbow-mode
#     :hook web-mode)
# #+end_src

# Use =web-mode= with embedded Ruby files, regular HTML, and PHP.

# #+begin_src emacs-lisp
#   (zb/add-auto-mode
#    'web-mode
#    "\\.erb$"
#    "\\.html$"
#    "\\.php$"
#    "\\.rhtml$")
# #+end_src

** YAML

#+begin_src emacs-lisp
  (use-package yaml-mode)
#+end_src

