dot_emacs.d/configuration.org
* Terminal

# I use =multi-term= to manage my shell sessions. It's bound to =C-c t=.

# #+begin_src emacs-lisp
#   (use-package multi-term)
#   (global-set-key (kbd "C-c t") 'multi-term)
# #+end_src

# Use a login =bash= shell:

# #+begin_src emacs-lisp
#   (setq multi-term-program-switches "--login")
# #+end_src

I add a bunch of hooks to =term-mode=:

- I'd like links (URLs, etc) to be clickable.
- Yanking in =term-mode= doesn't quite work. The text from the paste appears in
  the buffer but isn't sent to the shell process. This correctly binds =C-y= and
  middle-click to yank the way we'd expect.
- I bind =M-o= to quickly change windows. I'd like that in terminals, too.
- I don't want to perform =yasnippet= expansion when tab-completing.

#+begin_src emacs-lisp
  (defun zb/term-paste (&optional string)
    (interactive)
    (process-send-string
     (get-buffer-process (current-buffer))
     (if string string (current-kill 0))))

  (add-hook 'term-mode-hook
            (lambda ()
              (goto-address-mode)
              (define-key term-raw-map (kbd "C-y") 'zb/term-paste)
              (define-key term-raw-map (kbd "<mouse-2>") 'zb/term-paste)
              (define-key term-raw-map (kbd "M-o") 'other-window))
              (setq yas-dont-activate t))
#+end_src

* Publishing and task management with Org-mode

I'd like the initial scratch buffer to be in Org:

#+begin_src emacs-lisp
  (setq initial-major-mode 'org-mode)
#+end_src

** Display preferences

I like to see an outline of pretty bullets instead of a list of asterisks.

# #+begin_src emacs-lisp
#   (use-package org-bullets
#     :init
#     (add-hook 'org-mode-hook 'org-bullets-mode))
# #+end_src

# I like seeing a little downward-pointing arrow instead of the usual ellipsis
# (=...=) that org displays when there's stuff under a header.

# #+begin_src emacs-lisp
#   (setq org-ellipsis "⤵")
# #+end_src

# Use syntax highlighting in source blocks while editing.

# #+begin_src emacs-lisp
#   (setq org-src-fontify-natively t)
# #+end_src

# Make TAB act as if it were issued in a buffer of the language's major mode.

# #+begin_src emacs-lisp
#   (setq org-src-tab-acts-natively t)
# #+end_src

When editing a code snippet, use the current window rather than popping open a
new one (which shows the same information).

# #+begin_src emacs-lisp
#   (setq org-src-window-setup 'current-window)
# #+end_src

Quickly insert a block of elisp:

# #+begin_src emacs-lisp
#   (add-to-list 'org-structure-template-alist
#                '("el" . "src emacs-lisp"))
# #+end_src

Don't indent newly expanded blocks, even if they're under a heading.

# #+begin_src emacs-lisp
#   (setq org-adapt-indentation nil)
# #+end_src

** Task management and agenda views

Store my org files in =~/documents/org=, maintain an inbox in Dropbox, define
the location of an index file (my main todo list), and archive finished tasks in
=~/documents/org/archive.org=.

#+begin_src emacs-lisp
  (setq org-directory "~/Documents/org")

  (defun org-file-path (filename)
    "Return the absolute address of an org file, given its relative name."
    (concat (file-name-as-directory org-directory) filename))

  (setq org-inbox-file "~/sync/Dropbox/inbox.org")
  (setq org-index-file (org-file-path "index.org"))
  (setq org-archive-location
        (concat (org-file-path "archive.org") "::* From %s"))
#+end_src

I use [[http://agiletortoise.com/drafts/][Drafts]] to create new tasks, format them according to a template, and
append them to an "inbox.org" file in my Dropbox. This function lets me import
them easily from that inbox file to my index.

#+begin_src emacs-lisp
  (defun zb/copy-tasks-from-inbox ()
    (when (file-exists-p org-inbox-file)
      (save-excursion
        (find-file org-index-file)
        (goto-char (point-max))
        (insert-file-contents org-inbox-file)
        (delete-file org-inbox-file))))
#+end_src

I store most of my personal tasks in my index and maintain a separate file for
work-related tasks, so I'd like to derive my agenda from those files. I've also
got some annual OKRs in =goals.org=.

I also keep a schedule in =events.org=. Plus some recurring events in,
reasonably, a =recurring-events.org= file. Those are (mostly) structured as
=org-habit= items so they can recur according to a schedule.

#+begin_src emacs-lisp
  (setq org-agenda-files (list org-index-file
                               (org-file-path "events.org")
                               (org-file-path "goals.org")
                               (org-file-path "recurring-events.org")
                               (org-file-path "work.org")))
#+end_src

Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
place in the archive.

#+begin_src emacs-lisp
  (defun zb/mark-done-and-archive ()
    "Mark the state of an org-mode item as DONE and archive it."
    (interactive)
    (org-todo 'done)
    (org-archive-subtree))

  (define-key org-mode-map (kbd "C-c C-x C-s") 'zb/mark-done-and-archive)
#+end_src

Record the time that a todo was archived.

#+begin_src emacs-lisp
  (setq org-log-done 'time)
#+end_src

Ensure that a task can't be marked as done if it contains unfinished subtasks or
checklist items. This is handy for organizing "blocking" tasks hierarchically.

#+begin_src emacs-lisp
  (setq org-enforce-todo-dependencies t)
  (setq org-enforce-todo-checkbox-dependencies t)
#+end_src

Begin weeks /today/, not on the last Monday.

#+begin_src emacs-lisp
  (setq org-agenda-start-on-weekday nil)
#+end_src

# Hide the category prefix from tasks. In practice, I've usually only got one or
# two files of tasks, so prefixing tasks with the file they're stored in is mostly
# redundant.

# #+begin_src emacs-lisp
#   (setq org-agenda-prefix-format '((agenda . " %i %?-12t% s")
#                                    (todo . " %i ")
#                                    (tags . " %i ")
#                                    (search . " %i ")))
# #+end_src

I use =org=habit= to schedule recurring events and reminders for myself.

#+begin_src emacs-lisp
  (require 'org-habit)
#+end_src

# Don't show the =org-habit= consistency graph. I don't actually find it
# motivating, personally, and it kinda visually fills up my agenda. There's no
# provided way to disable the graph, as far as I can tell, so I've just redefined
# the function to do nothing.

# #+begin_src emacs-lisp
#   (defun org-habit-build-graph (habit starting current ending)
#     "                             ")
#   (setq org-habit-graph-column 60)
# #+end_src

I've got some custom agenda views that I use to visualize what I'm working on.

The "Personal agenda" view is a bit complicated; it displays:

1. My agenda for the next few days, including any recurring habits or scheduled
   events,
2. All the other, not-high-priority non-habit TODO items,
3. All the PENDING tasks, which are awaiting a response from someone else but
   still require my attention (I might need to ping someone, say), and
4. All the BLOCKED tasks, which are pending other tasks (but might be worth
   keeping an eye on anyway).

I effectively use the "A" priority to decide where I want to focus my attention
on a given day (I'll assign those priorities the night before, if I'm really on
top of things), so displaying them at the top makes sense.

A lot of this is based on [[https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html][Aaron Bieber's agenda configuration]], including the
=skip-subtree-if-priority= and =skip-subtree-if-habit= functions, which I've
shamelessly stolen and re-prefixed.

#+begin_src emacs-lisp
  (defun zb/org-skip-subtree-if-priority (priority)
    "Skip an agenda subtree if it has a priority of PRIORITY.

  PRIORITY may be one of the characters ?A, ?B, or ?C."
    (let ((subtree-end (save-excursion (org-end-of-subtree t)))
          (pri-value (* 1000 (- org-lowest-priority priority)))
          (pri-current (org-get-priority (thing-at-point 'line t))))
      (if (= pri-value pri-current)
          subtree-end
        nil)))

  (defun zb/org-skip-subtree-if-habit ()
    "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
    (let ((subtree-end (save-excursion (org-end-of-subtree t))))
      (if (string= (org-entry-get nil "STYLE") "habit")
          subtree-end
        nil)))

  (setq org-agenda-custom-commands
        '(("p" "Personal agenda"
           ((agenda "")
            (todo "TODO"
                  ((org-agenda-skip-function '(or (zb/org-skip-subtree-if-priority ?A)
                                                  (zb/org-skip-subtree-if-habit)))
                   (org-agenda-overriding-header "Other tasks:")))
            (todo "PENDING"
                  ((org-agenda-skip-function '(zb/org-skip-subtree-if-priority ?A))
                   (org-agenda-overriding-header "Pending:")))
            (todo "BLOCKED"
                  ((org-agenda-skip-function '(zb/org-skip-subtree-if-priority ?A))
                   (org-agenda-overriding-header "Blocked:")))))))
#+end_src

# ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
# ;; Org-Mode tweaks
# ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
# (setq org-todo-keywords
#       '((sequence "TODO(t)" "|" "DONE(d)")
#         (sequence "WAITING(w)" "CANCELED(c)")
# 	(sequence "ACTIVE(a)")))
# (setq org-todo-keyword-faces
#       '(("ACTIVE" . (:foreground "yellow")) ("WAITING" . (:foreground "cyan")) ("CANCELED" . (:foreground "purple" :weight bold))))


# ;; Bind Org Capture to C-c c
# (global-set-key "\C-cc" 'org-capture)

# ;; (setq org-default-notes-file (concat "~/Nextcloud/GTD/inbox.org"))
# ;; (add-to-list 'org-capture-templates
# ;;              '("t" "To Do"  entry
# ;;                (file "~/Nextcloud/GTD/inbox.org")
# ;;                "* TODO %?" :empty-lines 1))

# ;; (add-to-list 'org-capture-templates
#              ;; '("w" "Work-related Task"  entry
#              ;;   (file "~/Nextcloud/GTD/work.org")
#              ;;   "* TODO %?" :empty-lines 1))


I consult my agenda pretty often, so I bind =C-c d= to open it a it faster. This
also copies any files I've sent through Drafts into my index file before
displaying the index, so they'll be in the agenda view, too.

#+begin_src emacs-lisp
  (defun zb/dashboard ()
    (interactive)
    (zb/copy-tasks-from-inbox)
    (find-file org-index-file)
    (org-agenda nil "p"))

  (global-set-key (kbd "C-c d") 'zb/dashboard)
#+end_src

