dot_emacs.d/configuration.el

(setq org-capture-templates
      '(("b" "Blog idea"
         entry
         (file "~/Documents/notes/blog-ideas.org")
         "* %?\n")

        ("c" "Contact"
         entry
         (file "~/Documents/contacts.org")
         "* %(org-contacts-template-name)
:PROPERTIES:
:ADDRESS: %^{123 Fake St., City, ST 12345}
:PHONE: %^{555-555-5555}
:EMAIL: %(org-contacts-template-email)
:NOTE: %^{note}
:END:")

        ("d" "Delivery" entry
         (file+headline "~/Documents/org/events.org" "Deliveries")
         "** %?\n   SCHEDULED: %t\n")

        ("e" "Email" entry
         (file+headline org-index-file "Inbox")
         "* TODO %?\n\n%a\n\n")

        ("f" "Finished book"
         table-line (file "~/Documents/notes/books-read.org")
         "| %^{Title} | %^{Author} | %u |")

        ("s" "Subscribe to an RSS feed"
         plain
         (file "~/Documents/rss-feeds.org")
         "*** [[%^{Feed URL}][%^{Feed name}]]")

        ("t" "Todo"
         entry
         (file+headline org-index-file "Inbox")
         "* TODO %?\n:PROPERTIES:\nCREATED: %u\n:END:\n")))

(setq org-refile-use-outline-path t)
(setq org-outline-path-complete-in-steps nil)

(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(define-key global-map "\C-cc" 'org-capture)

(defun zb/open-index-file ()
  "Open the master org TODO list."
  (interactive)
  (zb/copy-tasks-from-inbox)
  (find-file org-index-file)
  (flycheck-mode -1)
  (end-of-buffer))

(global-set-key (kbd "C-c i") 'zb/open-index-file)

(defun org-capture-todo ()
  (interactive)
  (org-capture :keys "t"))

(global-set-key (kbd "M-n") 'org-capture-todo)
(add-hook 'gfm-mode-hook
          (lambda () (local-set-key (kbd "M-n") 'org-capture-todo)))
(add-hook 'haskell-mode-hook
          (lambda () (local-set-key (kbd "M-n") 'org-capture-todo)))

(defun zb/open-work-file ()
  "Open the work TODO list."
  (interactive)
  (find-file (org-file-path "work.org"))
  (flycheck-mode -1)
  (end-of-buffer))

(global-set-key (kbd "C-c w") 'zb/open-work-file)

(require 'ox-md)
(require 'ox-beamer)

(setq org-confirm-babel-evaluate nil)

(use-package htmlize)

(setq org-export-with-smart-quotes t)

(setq org-html-postamble nil)

(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "firefox")

(setenv "BROWSER" "firefox")

(setq org-latex-pdf-process
      '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

(add-to-list 'org-latex-packages-alist '("" "minted"))
(setq org-latex-listings 'minted)

(setq TeX-PDF-mode t)

(setq-default TeX-engine 'default)
(setq TeX-parse-self t)
;; (latex-preview-pane-enable)

(use-package auctex-lua)
(use-package auctex-latexmk)
(use-package textmate)
(use-package cdlatex)
(use-package latex-extra)
(use-package latex-math-preview)
(use-package latex-unicode-math-mode)
(use-package ebib)

(add-hook 'LaTeX-mode-hook
          (lambda ()
            (LaTeX-math-mode)
            (setq TeX-master t)))
