dot_emacs.d/configuration.org
* Blogging

# I maintain a blog written in Jekyll. There are plenty of command-line tools to
# automate creating a new post, but staying in my editor minimizes friction and
# encourages me to write.

# This defines a =zb/new-blog-post= function, which prompts the user for a title
# and creates a new draft (with a slugged file name) in the blog's =_drafts/=
# directory. The new post includes appropriate YAML header information.

# This also defines =zb/publish-post= and =zb/unpublish-post=, which adjust the
# date in the YAML front matter and rename the file appropriately.

# #+begin_src emacs-lisp
# 	(defvar zb/jekyll-drafts-directory "/home/zb/Documents/blog/_drafts/")
# 	(defvar zb/jekyll-posts-directory "/home/zb/Documents/blog/_posts/")
# 	(defvar zb/jekyll-post-extension ".md")

# 	(defun zb/timestamp ()
# 		(format-time-string "%Y-%m-%d"))

# 	(defun zb/replace-whitespace-with-hyphens (s)
# 		(replace-regexp-in-string " " "-" s))

# 	(defun zb/replace-nonalphanumeric-with-whitespace (s)
# 		(replace-regexp-in-string "[^A-Za-z0-9 ]" " " s))


# 	(defun zb/replace-unusual-characters (title)
# 		"Remove quotes, downcase everything, and replace characters
# 	that aren't alphanumeric with hyphens."
# 		(zb/replace-whitespace-with-hyphens
# 		 (s-trim
# 			(downcase
# 			 (zb/replace-nonalphanumeric-with-whitespace
# 				(zb/remove-quotes title))))))

# 	(defun zb/slug-for (title)
# 		"Given a blog post title, return a convenient URL slug.
# 		 Downcase letters and remove special characters."
# 		(let ((slug (zb/replace-unusual-characters title)))
# 			(while (string-match "--" slug)
# 				(setq slug (replace-regexp-in-string "--" "-" slug)))
# 			slug))

# 	(defun zb/jekyll-yaml-template (title)
# 		"Return the YAML header information appropriate for a blog
# 		 post. Include the title, the current date, the post layout,
# 		 and an empty list of tags."
# 		(concat
# 		 "---\n"
# 		 "title: " title "\n"
# 		 "date:\n"
# 		 "layout: post\n"
# 		 "# pdf_file: " (zb/slug-for title) ".pdf\n"
# 		 "tags: []\n"
# 		 "---\n\n"))

# 	(defun zb/new-blog-post (title)
# 		"Create a new blog draft in Jekyll."
# 		(interactive "sPost title: ")
# 		(let ((post (concat zb/jekyll-drafts-directory
# 												(zb/slug-for title)
# 												zb/jekyll-post-extension)))
# 			(if (file-exists-p post)
# 					(find-file post)
# 				(find-file post)
# 				(insert (zb/jekyll-yaml-template title)))))

# 	(defun zb/jekyll-draft-p ()
# 		"Return true if the current buffer is a draft."
# 		(equal
# 		 (file-name-directory (buffer-file-name (current-buffer)))
# 		 zb/jekyll-drafts-directory))

# 	(defun zb/jekyll-published-p ()
# 		"Return true if the current buffer is a published post."
# 		(equal
# 		 (file-name-directory (buffer-file-name (current-buffer)))
# 		 zb/jekyll-posts-directory))

# 	(defun zb/publish-post ()
# 		"Move a draft post to the posts directory, rename it to include
# 	the date, reopen the new file, and insert the date in the YAML
# 	front matter."
# 		(interactive)
# 		(cond ((not (zb/jekyll-draft-p))
# 					 (message "This is not a draft post."))
# 					((buffer-modified-p)
# 					 (message "Can't publish post; buffer has modifications."))
# 					(t
# 					 (let ((filename
# 									(concat zb/jekyll-posts-directory
# 													(zb/timestamp) "-"
# 													(file-name-nondirectory
# 													 (buffer-file-name (current-buffer)))))
# 								 (old-point (point)))
# 						 (rename-file (buffer-file-name (current-buffer))
# 													filename)
# 						 (kill-buffer nil)
# 						 (find-file filename)
# 						 (set-window-point (selected-window) old-point)
# 						 (save-excursion
# 							 (beginning-of-buffer)
# 							 (replace-regexp "^date:$" (concat "date: " (zb/timestamp))))
# 						 (save-buffer)
# 						 (message "Published post!")))))

# 	(defun zb/unpublish-post ()
# 		"Move a published post to the drafts directory, rename it to
# 	exclude the date, reopen the new file, and remove the date in the
# 	YAML front matter."
# 		(interactive)
# 		(cond ((not (zb/jekyll-published-p))
# 					 (message "This is not a published post."))
# 					((buffer-modified-p)
# 					 (message "Can't publish post; buffer has modifications."))
# 					(t
# 					 (let ((filename
# 									(concat zb/jekyll-drafts-directory
# 													(substring
# 													 (file-name-nondirectory
# 														(buffer-file-name (current-buffer)))
# 													 11 nil)))
# 								 (old-point (point)))
# 						 (rename-file (buffer-file-name (current-buffer))
# 													filename)
# 						 (kill-buffer nil)
# 						 (find-file filename)
# 						 (set-window-point (selected-window) old-point)
# 						 (save-excursion
# 							 (beginning-of-buffer)
# 							 (replace-regexp "^date: [0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]$" "date:"))
# 						 (save-buffer)
# 						 (message "Returned post to drafts!")))))
# #+end_src

# This selects and inserts a tag:

# #+begin_src emacs-lisp
#   (defun zb/existing-blog-tags ()
#     "Return a list of all the tags currently used in my blog."
#     (split-string (shell-command-to-string "cd ~/Documents/blog && rake tags")))

#   (defun zb/insert-blog-tag ()
#     "Prompt for one of the existing tags used in the blog and
#   insert it in the YAML front matter appropriately."
#     (interactive)
#     (save-excursion
#       (beginning-of-buffer)
#       (search-forward-regexp "^tags: \\[")
#       (insert
#        (ivy-completing-read "Insert tag: " (zb/existing-blog-tags))
#        (if (looking-at "\\]") "" ", ")))
#     (message "Tagged!"))
# #+end_src




# # ** Look up definitions in Webster 1913

# # I look up definitions by hitting =C-x w=, which shells out to =sdcv=. I've
# # loaded that with the (beautifully lyrical) 1913 edition of Webster's dictionary,
# # so these definitions are a lot of fun.

# # #+begin_src emacs-lisp
# #   (defun zb/dictionary-prompt ()
# #     (read-string
# #      (format "Word (%s): " (or (zb/region-or-word) ""))
# #      nil
# #      nil
# #      (zb/region-or-word)))

# #   (defun zb/dictionary-define-word ()
# #     (interactive)
# #     (let* ((word (zb/dictionary-prompt))
# #            (buffer-name (concat "Definition: " word)))
# #       (with-output-to-temp-buffer buffer-name
# #         (shell-command (format "sdcv -n %s" word) buffer-name))))

# #   (define-key global-map (kbd "C-x w") 'zb/dictionary-define-word)
# # #+end_src

# # ** Look up words in a thesaurus

# # Hitting =C-x s= searches for synonyms for the word at point.

# # #+begin_src emacs-lisp
# #   (use-package powerthesaurus
# #     :bind
# #     ("C-x s" . powerthesaurus-lookup-word-dwim))
# # #+end_src

# # ** Editing with Markdown

# # Because I can't always use =org=.

# # - Associate =.md= files with GitHub-flavored Markdown.
# # - Use =pandoc= to render the results.
# # - Leave the code block font unchanged.

# # #+begin_src emacs-lisp
# #   (use-package markdown-mode
# #     :commands gfm-mode

# #     :mode (("\\.md$" . gfm-mode))

# #     :config
# #     (setq markdown-command "pandoc --standalone --mathjax --from=markdown")
# #     (custom-set-faces
# #      '(markdown-code-face ((t nil)))))
# # #+end_src

# # ** Cycle between spacing alternatives

# # Successive calls to =cycle-spacing= rotate between changing the whitespace
# # around point to:

# # - A single space,
# # - No spaces, or
# # - The original spacing.

# # Binding this to =M-SPC= is strictly better than the original binding of
# # =just-one-space=.

# # #+begin_src emacs-lisp
# #   (global-set-key (kbd "M-SPC") 'cycle-spacing)
# # #+end_src

# # ** Enable region case modification

# # #+begin_src emacs-lisp
# #   (put 'downcase-region 'disabled nil)
# #   (put 'upcase-region 'disabled nil)
# # #+end_src

# # ** Quickly explore my "notes" directory with =deft=

# # #+begin_src emacs-lisp
# #   (use-package deft
# #     :bind ("C-c n" . deft)
# #     :commands (deft)
# #     :config

# #     (setq deft-directory "~/Documents/notes"
# #           deft-recursive t
# #           deft-use-filename-as-title t)

# #     (evil-set-initial-state 'deft-mode 'emacs))
# # #+end_src

# # * File management with =dired=

# # Hide dotfiles by default, but toggle their visibility with =.=.

# # #+begin_src emacs-lisp
# #   (use-package dired-hide-dotfiles
# #     :config
# #     (dired-hide-dotfiles-mode)
# #     (define-key dired-mode-map "." 'dired-hide-dotfiles-mode))
# # #+end_src

# # Open media with the appropriate programs.

# # #+begin_src emacs-lisp
# #   (use-package dired-open
# #     :config
# #     (setq dired-open-extensions
# #           '(("avi" . "mpv")
# #             ("cbr" . "comix")
# #             ("doc" . "abiword")
# #             ("docx" . "abiword")
# #             ("gif" . "ffplay")
# #             ("gnumeric" . "gnumeric")
# #             ("html" . "firefox")
# #             ("jpeg" . "s")
# #             ("jpg" . "s")
# #             ("mkv" . "mpv")
# #             ("mov" . "mpv")
# #             ("mp3" . "mpv")
# #             ("mp4" . "mpv")
# #             ("pdf" . "zathura")
# #             ("png" . "s")
# #             ("webm" . "mpv")
# #             ("xls" . "gnumeric")
# #             ("xlsx" . "gnumeric"))))
# # #+end_src

# # These are the switches that get passed to =ls= when =dired= gets a list of
# # files. We're using:

# # - =l=: Use the long listing format.
# # - =h=: Use human-readable sizes.
# # - =v=: Sort numbers naturally.
# # - =A=: Almost all. Doesn't include "=.=" or "=..=".


# # #+begin_src emacs-lisp
# #   (setq-default dired-listing-switches "-lhvA")
# #   (add-hook 'dired-mode-hook (lambda () (dired-hide-details-mode 1)))
# # #+end_src

# # Set up DWIM ("do what I mean") for =dired=. When I've got two =dired= windows
# # side-by-side, and I move or copy files in one window, this sets the default
# # location to the other window.

# # #+begin_src emacs-lisp
# #   (setq dired-dwim-target t)
# # #+end_src

# # Kill buffers of files/directories that are deleted in =dired=.

# # #+begin_src emacs-lisp
# #   (setq dired-clean-up-buffers-too t)
# # #+end_src

# # Always copy directories recursively instead of asking every time.

# # #+begin_src emacs-lisp
# #   (setq dired-recursive-copies 'always)
# # #+end_src

# # Ask before recursively /deleting/ a directory, though.

# # #+begin_src emacs-lisp
# #   (setq dired-recursive-deletes 'top)
# # #+end_src

# # Files are normally moved and copied synchronously. This is fine for small or
# # local files, but copying a large file or moving a file across a mounted network
# # drive blocks Emacs until the process is completed. Unacceptable!

# # This uses =emacs-async= to make =dired= perform actions asynchronously.

# # #+begin_src emacs-lisp
# #   (use-package async
# #     :config
# #     (dired-async-mode 1))
# # #+end_src

# # Use "j" and "k" to move around in =dired=.

# # #+begin_src emacs-lisp
# #   (evil-define-key 'normal dired-mode-map (kbd "j") 'dired-next-line)
# #   (evil-define-key 'normal dired-mode-map (kbd "k") 'dired-previous-line)
# # #+end_src

# # I'm often browsing directories of photos and images, so this binds "v" to view a
# # slideshow of the current directory with =s= (a custom =feh= wrapper defined
# # elsewhere in this repo).

# # #+begin_src emacs-lisp
# #   (defun zb/dired-slideshow ()
# #     (interactive)
# #     (start-process "dired-slideshow" nil "s" (dired-current-directory)))

# #   (evil-define-key 'normal dired-mode-map (kbd "v") 'zb/dired-slideshow)
# # #+end_src

* Editing settings

** Quickly visit Emacs configuration

I futz around with my dotfiles a lot. This binds =C-c e= to quickly open my
Emacs configuration file.

#+begin_src emacs-lisp
  (defun zb/visit-emacs-config ()
    (interactive)
    (find-file "~/.emacs.d/configuration.org"))

  (global-set-key (kbd "C-c e") 'zb/visit-emacs-config)
#+end_src

** Always kill current buffer

Assume that I always want to kill the current buffer when hitting =C-x k=.

#+begin_src emacs-lisp
  (defun zb/kill-current-buffer ()
    "Kill the current buffer without prompting."
    (interactive)
    (kill-buffer (current-buffer)))

  (global-set-key (kbd "C-x k") 'zb/kill-current-buffer)
#+end_src

# ** Set up =helpful=

# The =helpful= package provides, among other things, more context in Help
# buffers.

# #+begin_src emacs-lisp
#   (use-package helpful)

#   (global-set-key (kbd "C-h f") #'helpful-callable)
#   (global-set-key (kbd "C-h v") #'helpful-variable)
#   (global-set-key (kbd "C-h k") #'helpful-key)
#   (evil-define-key 'normal helpful-mode-map (kbd "q") 'quit-window)
# #+end_src

** Look for executables in =/usr/local/bin=

#+begin_src emacs-lisp
  (zb/append-to-path "/usr/local/bin")
#+end_src

** Save my location within a file

Using =save-place-mode= saves the location of point for every file I visit. If I
close the file or close the editor, then later re-open it, point will be at the
last place I visited.

#+begin_src emacs-lisp
  (save-place-mode t)
#+end_src

** Always indent with spaces

Never use tabs. Tabs are the devil’s whitespace.

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

** Install and configure =which-key=

=which-key= displays the possible completions for a long keybinding. That's
really helpful for some modes (like =projectile=, for example).

#+begin_src emacs-lisp
  (use-package which-key
    :config (which-key-mode))
#+end_src

** Configure =yasnippet=

#+begin_src emacs-lisp
  (use-package yasnippet)
#+end_src

I keep my snippets in =~/.emacs/snippets/text-mode=, and I always want =yasnippet=
enabled.

#+begin_src emacs-lisp
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
;;  (setq yas-snippet-dirs '("~/.emacs.d/snippets/text-mode"))
  (yas-global-mode t)
#+end_src

I /don’t/ want =yas= to automatically indent the snippets it inserts. Sometimes
this looks pretty bad (when indenting org-mode, for example, or trying to guess
at the correct indentation for Python).

#+begin_src emacs-lisp
  (setq yas-indent-line 'auto)
#+end_src

# ** Configure =ivy= and =counsel=

# I use =ivy= and =counsel= as my completion framework.

# This configuration:

# - Uses =counsel-M-x= for command completion,
# - Replaces =isearch= with =swiper=,
# - Uses =smex= to maintain history,
# - Enables fuzzy matching everywhere except swiper (where it's thoroughly
#   unhelpful), and
# - Includes recent files in the switch buffer.

# #+begin_src emacs-lisp
#   (use-package counsel
#     :bind
#     ("M-x" . 'counsel-M-x)
#     ("C-s" . 'swiper)

#     :config
#     (use-package flx)
#     (use-package smex)

#     (ivy-mode 1)
#     (setq ivy-use-virtual-buffers t)
#     (setq ivy-count-format "(%d/%d) ")
#     (setq ivy-initial-inputs-alist nil)
#     (setq ivy-re-builders-alist
#           '((swiper . ivy--regex-plus)
#             (t . ivy--regex-fuzzy))))
# #+end_src

