dot_emacs.d/configuration.org
** Switch and rebalance windows when splitting

When splitting a window, I invariably want to switch to the new window. This
makes that automatic.

#+begin_src emacs-lisp
  (defun zb/split-window-below-and-switch ()
    "Split the window horizontally, then switch to the new pane."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun zb/split-window-right-and-switch ()
    "Split the window vertically, then switch to the new pane."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (global-set-key (kbd "C-x 2") 'zb/split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'zb/split-window-right-and-switch)
#+end_src

# ** Mass editing of =grep= results

# I like the idea of mass editing =grep= results the same way I can edit filenames
# in =dired=. These keybindings allow me to use =C-x C-q= to start editing =grep=
# results and =C-c C-c= to stop, just like in =dired=.

# #+begin_src emacs-lisp
#   (use-package wgrep)

#   (eval-after-load 'grep
#     '(define-key grep-mode-map
#       (kbd "C-x C-q") 'wgrep-change-to-wgrep-mode))

#   (eval-after-load 'wgrep
#     '(define-key grep-mode-map
#       (kbd "C-c C-c") 'wgrep-finish-edit))

#   (setq wgrep-auto-save-buffer t)
# #+end_src

** Use projectile everywhere

#+begin_src emacs-lisp
  (projectile-global-mode)
#+end_src

** Add a bunch of engines for =engine-mode=

Enable [[https://github.com/zb/engine-mode][engine-mode]] and define a few useful engines.

#+begin_src emacs-lisp
  (use-package engine-mode)
  (require 'engine-mode)

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")

  (defengine google
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s")

  (defengine rfcs
    "http://pretty-rfc.herokuapp.com/search?q=%s")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w")

  (defengine wiktionary
    "https://www.wikipedia.org/search-redirect.php?family=wiktionary&language=en&go=Go&search=%s")

  (defengine youtube
    "https://www.youtube.com/results?search_query=%s")

  (engine-mode t)
#+end_src

* Set custom keybindings

Just a few handy functions.

# #+begin_src emacs-lisp
#   (global-set-key (kbd "C-w") 'backward-kill-word)
#   (global-set-key (kbd "M-o") 'other-window)
# #+end_src

Remap when working in terminal Emacs.

#+begin_src emacs-lisp
  (define-key input-decode-map "\e[1;2A" [S-up])
#+end_src
* Extra

# #+begin_src emacs-lisp
#   (load-file "~/.emacs-private.el")
# #+end_src

# ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
# ;; elfeed feed reader
# ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#  (global-set-key (kbd "C-x w") 'elfeed)
#  (setq elfeed-feeds
#        '(("https://www.theverge.com/rss/index.xml" blog tech)
#  	("http://feeds.arstechnica.com/arstechnica/index" blog tech)
#  	("https://feeds.npr.org/1001/rss.xml" blog news)))
#  (setq-default elfeed-search-filter "@1-week-ago ")


#  use an org file to organise feeds
#  (use-package elfeed-org
#  (elfeed-org
#    :ensure t
#    :config
#    (elfeed-org)
#    (setq rmh-elfeed-org-files (list "~/Coding/rss_feeds.org")))

#  (setq rmh-elfeed-org-files (list "~/Coding/rss_feeds.org"))
#  shortcut functions
#  (defun bjm/elfeed-show-all ()
#    (interactive)
#    (bookmark-maybe-load-default-file)
#    (bookmark-jump "elfeed-all"))
#  (defun bjm/elfeed-show-emacs ()
#    (interactive)
#    (bookmark-maybe-load-default-file)
#    (bookmark-jump "elfeed-emacs"))
#  (defun bjm/elfeed-show-daily ()
#    (interactive)
#    (bookmark-maybe-load-default-file)
#    (bookmark-jump "elfeed-daily"))

#  (use-package elfeed
#    :ensure t
#    :bind (:map elfeed-search-mode-map
#                ("A" . bjm/elfeed-show-all)
#                ("E" . bjm/elfeed-show-emacs)
#                ("D" . bjm/elfeed-show-daily)
#                ("q" . bjm/elfeed-save-db-and-bury)))
